#+STARTUP: overview
#+TITLE: Ejercicios JS
#+LANGUAGE: es
#+OPTIONS: num:nil
#+ATTR_HTML: :style margin-left: auto; margin-right: auto;
#+SETUPFILE: https://fniessen.github.io/org-html-themes/org/theme-readtheorg.setup

** Respuesta
   #+begin_src js :tangle Ejercicio2.js
      let valores = [true, 5, false, 'hola', 'adios', 2];
      let str1 = valores[3].length;
      let str2 = valores[4].length;
      let mayor;

      if( str1 > str2 ){
          mayor = valores[3];
      }

      if( str1 < str2) {
          mayor = valores[4];
      }

      if( str1 == str2) {
          mayor = 'ninguno.';
      }

      console.log('el elemento de texto mayor es:', mayor );
   #+end_src

   #+RESULTS:
   : el elemento de texto mayor es: adios
   : undefined

** Respuesta
   #+begin_src js :tangle Ejercicio3.js
     let numero1 = 5;
     let numero2 = 8;

     if( numero1 <= numero2)
     {
         console.log("número 1 no es mayor que número 2");
     }
     if( numero1 >= 0 )
     {
         console.log("número 2 es positivo");
     }
     if( numero1 < 0 )
     {
         console.log("número 1 es negativo o distinto de cero");
     }
     if( (numero1 + 1) <= numero2 )
     {
         console.log("Incrementar en 1 unidad el valor del número 1 no lo hace mayor que el número 2");
     }
   #+end_src

 #+RESULTS:
 : número 1 no es mayor que número 2
 : número 2 es positivo
 : Incrementar en 1 unidad el valor del número 1 no lo hace mayor que el número 2
 : undefined
** Respuesta
   #+begin_src js :tangle Ejercicio4.js
     function factorial( num ) {
         let result = num;

         for (let i = 1; num > i; i++){
             result *= i;
         }

         return result;
     }

     let userInput;
     let result;

     userInput = prompt('Introduzca un numero');

     output = factorial(userInput);
     console.log(output);
   #+end_src

   #+RESULTS:
   : 120
   : undefined

** Respuesta
   #+begin_src js :tangle Ejercicio5.js
     function whichCase ( string ){
         let result;

         if( string == string.toUpperCase() ){
             result = 'Mayúsculas';
             return result;
         }

         if( string == string.toLowerCase() ){
             result = 'Minúsculas';
             return result;
         }

         return result = 'Ambos';
     }

     let userInput;
     let output;

     userInput = prompt('Introduzca un texto');

     output = whichCase(userInput);
     console.log('El texto esta compuesta por:', output);
   #+end_src

   #+RESULTS:
   : Ambos
   : undefined

** Respuesta
   #+begin_src js :tangle Ejercicio6.js
     function isPair ( num ) {

         if( num % 2 == 0){
             return 'Par';
         }

         return 'Impar';
     }

     let userInput;
     let output;

     userInput = prompt('Introduzca un numero');

     output = isPair(userInput);
     console.log('El numero es:', output);
   #+end_src

   #+RESULTS:
   : El numero es: Impar
   : undefined

** Respuesta
   #+begin_src js :tangle Ejercicio7.js
     function isPrime( num ) {
         let result;
         num <= 1 ? result = false : result = true;

         for ( let i = 2; num > i; i++ ) {
             if ( num % i == 0 ) { result = false; }
         }

         result == true ? result = 'primo' : result = 'no primo';

         return result;
     }

     userInput = prompt('Introduzca un numero');

     output = isPrime(userInput);
     console.log('El numero es:', output);
   #+end_src

   #+RESULTS:
   : El numero es: no primo
   : undefined

